[
    {
        "tag": "greeting",
        "patterns": [
            "Hi","hii",
            "Hello",
            "Hey",
            "How are you",
            "What's up"
        ],
        "responses": [
           "Hello! Welcome to the Breast Cancer Assistant. How can I help you today?", "Hi there! Feel free to ask any questions about breast cancer."
        ]
    },
    {
        "tag": "goodbye",
        "patterns": [
            "Bye",
            "See you later",
            "Goodbye",
            "Take care"
        ],
        "responses": [
           "Goodbye! Stay healthy and informed.", "Take care! Let me know if you have more questions in the future."
        ]
    },
    {
        "tag": "thanks",
        "patterns": [
            "Thank you",
            "Thanks",
            "Thanks a lot",
            "I appreciate it"
        ],
        "responses": [
            "You're welcome",
            "No problem",
            "Glad I could help"
        ]
    },
    {
        "tag": "about",
        "patterns": [
            "What can you do?",
            "Who are you?",
            "What are you?",
            "your purpose?",
            "about yourself?",
            "How can you help with breast cancer?"
        ],
        "responses": [
            "I am a Breast Cancer Assistant chatbot designed to provide information and support related to breast cancer.",
            "My purpose is to assist you with understanding breast cancer, its risk factors, detection, and treatment options.",
            "I can answer questions about breast cancer, guide you on how to use the detection tool, and provide resources for support and awareness.",
            "I aim to spread awareness about breast cancer and help users access relevant information."
        ]
    }
    ,
    {
        "tag": "help",
        "patterns": [
            "Help",
            "I need help",
            "Can you help me"
        ],
        "responses": [
            "Sure, what do you need help with?",
            "I'm here to help. What's the problem?",
            "How can I assist you?"
        ]
    },

    {
        "tag": "name",
        "patterns": [
            "your name",
            "Do you have a name",
            "What should I call you"
        ],
        "responses": [
            "You can call me Chatbot.",
            "My name is Chatbot."
        ]
    },
    {
        "tag": "compliment",
        "patterns": [
            "You're awesome",
            "You're great",
            "I like you"
        ],
        "responses": [
            "Thank you! I'm just a program, but I'm here to assist and make your experience better.",
            "I'm glad you think so! My purpose is to help and provide useful information."
        ]
    },
    {
        "tag": "definition",
        "patterns": [
          "What is breast cancer?",
          "Tell me about breast cancer",
          "What do you mean by breast cancer?"
        ],
        "response": [
          "Breast cancer is a type of cancer that begins in the cells of the breast. It is more common in women but can also affect men."
        ]
      },
    {
        "tag": "positivity",
        "patterns": [
            "Spread some positivity",
            "a positive quote",
            "stay positive",
             "Inspirational quotes",
            "Motivational sayings"
        ],
        "responses": [
            "Every day is a new opportunity to make a positive impact. You are capable of great things!",
            "Remember, you are strong, resilient, and capable of overcoming challenges.",
            "The future belongs to those who believe in the beauty of their dreams. - Eleanor Roosevelt",
            "In the middle of every difficulty lies opportunity. - Albert Einstein",
            "Your time is limited, don't waste it living someone else's life. - Steve Jobs"
        ]
    },
    {
        "tag": "self_improvement",
        "patterns": [
            "How to improve myself",
            "about personal growth",
            "Tips for self-development"
        ],
        "responses": [
            "Self-improvement involves setting goals, embracing continuous learning, staying positive, and practicing self-care.",
            "Embrace challenges as opportunities for growth, and focus on becoming the best version of yourself."
        ]
    },
    {
        "tag": "self_care",
        "patterns": [
            "self-care",
            "practice self-care",
            "Importance of self-love"
        ],
        "responses": [
            "Self-care involves taking care of one's physical, emotional, and mental well-being.",
            "Prioritizing self-care can lead to improved overall health and a more balanced lifestyle."
        ]
    },
 


    
    {
        "tag": "symptoms",
        "patterns": [
            "symptoms of breast cancer?",
            "How to know if I have breast cancer?",
            "Signs of breast cancer"
        ],
        "responses": [
            "Common symptoms include a lump in the breast or underarm, changes in breast shape, dimpling of the skin, and nipple discharge.",
            "Look for changes in breast size, texture, or pain in the breast or nipple. It's best to consult a doctor if you notice any unusual signs."
        ]
    },
    {
        "tag": "causes",
        "patterns": [
            "causes breast cancer?",
            "Why does breast cancer occur?"
        ],
        "responses": [
            "Breast cancer can be caused by genetic factors, hormonal changes, lifestyle choices, and environmental influences.",
            "While the exact cause isn't always clear, factors like BRCA mutations, prolonged estrogen exposure, and age can increase the risk."
        ]
    },
    {
        "tag": "stages",
        "patterns": [
            "What are the stages of breast cancer?",
            "Explain the stages of breast cancer",
            "How is breast cancer staged?"
        ],
        "responses": [
            "Breast cancer is classified into stages 0 to IV, based on tumor size, lymph node involvement, and whether it has spread to other parts of the body.",
            "Stage 0 indicates non-invasive cancer, while stage IV represents metastatic cancer that has spread beyond the breast."
        ]
    },

    {
        "tag": "prevention",
        "patterns": [
            "How to prevent?",
            "What can I do to prevent breast cancer?",
            "Tips to avoid breast cancer"
        ],
        "responses": [
            "Maintain a healthy lifestyle, exercise regularly, limit alcohol consumption, and avoid smoking.",
            "Early detection through regular screenings and self-exams can also help in prevention and timely treatment."
        ]
    },
    {
        "tag": "early_detection",
        "patterns": [
            "Why early detection important?",
            "How early detection help?",
            "Benefits of detecting breast cancer early"
        ],
        "responses": [
            "Early detection significantly improves survival rates by identifying cancer before it spreads.",
            "Treatments are often more effective and less invasive when breast cancer is caught early."
        ]
    },
    {
        "tag": "myths",
        "patterns": [
            "some myths about breast cancer?",
            "Is it true that only women get breast cancer?",
            "wearing a bra cause breast cancer?"
        ],
        "responses": [
            "Common myths include: 'Only women get breast cancer' (men can too) and 'Antiperspirants cause breast cancer' (there is no evidence to support this).",
            "Another myth is that 'a breast lump always means cancer'—many lumps are benign, but they should still be checked by a doctor."
        ]
    },
    {
        "tag": "mammograms",
        "patterns": [
            "mammogram?",
            "How mammogram work?",
            "When should I get a mammogram?"
        ],
        "responses": [
            "A mammogram is an X-ray of the breast used to detect abnormalities. It is recommended for women over 40 to have one annually.",
            "Mammograms are key in detecting breast cancer early, often before symptoms appear."
        ]
    },
    {
        "tag": "genetic_testing",
        "patterns": [
            "genetic testing for breast cancer?",
            "Should I get tested for BRCA genes?",
            "How to check genetic risk for breast cancer?"
        ],
        "responses": [
            "Genetic testing looks for mutations in genes like BRCA1 and BRCA2 that increase breast cancer risk. It is recommended for those with a strong family history.",
            "Talk to a genetic counselor to understand if testing is appropriate for you."
        ]
    },
    {
        "tag": "awareness",
        "patterns": [
            "breast cancer awareness month?",
            "pink ribbon important?",
            "breast cancer awareness campaigns?"
        ],
        "responses": [
            "Breast Cancer Awareness Month is observed in October to promote early detection and support research and funding.",
            "The pink ribbon symbolizes solidarity and hope for those affected by breast cancer."
        ]
    },
    {
        "tag": "side_effects",
        "patterns": [
            "side effects of breast cancer treatment?",
            "chemotherapy affect the body?",
            "side effects of radiation therapy?"
        ],
        "responses": [
            "Common side effects include fatigue, hair loss, nausea, and skin changes. Radiation can cause localized irritation, and hormonal therapy may lead to hot flashes or bone thinning.",
            "Your doctor can help manage side effects with medications and lifestyle adjustments."
        ]
    },


    {
        "tag": "education",
        "patterns": ["What is breast cancer?", "Tell me about breast cancer symptoms."],
        "responses": ["Breast cancer is a type of cancer that forms in the cells of the breast."]
    },
    {
        "tag": "predict",
        "patterns": ["Can you predict my risk?", "Predict breast cancer for me."],
        "responses": ["Sure! Please provide your medical test results."]
    },
    {
        "tag": "emotional_support",
        "patterns": ["I'm scared.", "I feel anxious","i am worried"],
        "responses": ["It's normal to feel this way. Remember, you're not alone in this."]
    },
    
    {
        "tag": "machine_learning",
        "patterns": [
            "machine learning algorithm did you use?",
            "How machine learning help in detecting breast cancer?",
            "What role does AI play in this project?"
        ],
        "responses": [
            "I used the XGBoost algorithm, which is highly accurate for classification problems like breast cancer detection.",
            "Machine learning analyzes patterns in the data to classify whether a tumor is benign or malignant.",
            "AI enhances early detection by identifying complex patterns in medical data that might be missed by humans."
        ]
    },
        {
            "tag": "world_indian_stats",
            "patterns": ["global stats on breast cancer?", "How common is breast cancer in India?","India breast cancer number?","world breast cancer number?","Breast cancer in india"],
            "responses": ["Globally, breast cancer accounts for 12% of all cancer cases. In India, it contributes to 14% of cancers among women."]
        },
        {
            "tag": "technology_use",
            "patterns": ["technologies used in detection?", "How AI help?","what technology is used?","how it's working"],
            "responses": ["AI and ML enhance early detection through pattern recognition in medical data."]
        },
        {
            "tag": "accuracy",
            "patterns": ["How accurate is your model?", "Can I trust the results?","is it valid to use?","accuracy"],
            "responses": ["The XGBoost model has an accuracy of 98.2%. Consult a doctor for final confirmation."]
        },
        {
            "tag": "how_to_use",
            "patterns": ["how to use this chatbot?", "What data do I need?","how to use?","how to use"],
            "responses": ["Provide medical test results when prompted, such as mean radius and mean texture."]
        },
        {
            "tag": "history",
            "patterns": ["breast cancer first studied", "How treatment evolved?","history"],
            "responses": ["Breast cancer was known since ancient Egypt, with modern treatments evolving in the 20th century."]
        },
        {
            "tag": "pink_ribbon",
            "patterns": ["What the pink ribbon mean?", "Why is it a symbol?","breast cancer symbol","what is pink ribbon?"],
            "responses": ["The pink ribbon symbolizes breast cancer awareness, introduced in 1992 to support the cause."]
        },
            {
                "tag": "risk_factors",
                "patterns": ["risk factors for breast cancer?", "Who is at risk?","risk"],
                "responses": ["Risk factors include family history, age, obesity, and genetic mutations like BRCA1 and BRCA2."]
            },
            {
                "tag": "self_examination",
                "patterns": ["How do I check for lumps?", "a self-breast exam?","how to check","how to check lumps"],
                "responses": ["Perform a self-exam monthly. Look for changes in size, shape, or texture and feel for lumps."]
            },
            {
                "tag": "treatment_options",
                "patterns": ["treatments for breast cancer", "How is it treated?","treatment","solution"],
                "responses": ["Treatments include surgery, chemotherapy, radiation, and targeted therapy."]
            },
            {
                "tag": "diet_lifestyle",
                "patterns": ["foods prevent breast cancer", "reduce my risk?","diet","what should i eat?"],
                "responses": ["Maintain a healthy weight, eat a diet rich in fruits and vegetables, and exercise regularly."]
            },
            {
                "tag": "types",
                "patterns": ["What are the different types of breast cancer?", "Tell me about invasive breast cancer.","types of breast cancer"],
                "responses": ["Types include ductal carcinoma, lobular carcinoma, and triple-negative breast cancer."]
            },   {
                "tag": "support_groups",
                "patterns": ["Are there any support groups for breast cancer?", "Where can I find emotional support?", "Tell me about support for breast cancer patients.","emotional support"],
                "responses": ["There are many support groups, such as Breast Cancer Network and Survivor Circles.", "Join organizations like the National Breast Cancer Foundation for resources and community support."]
            },
            {
                "tag": "survival_rates",
                "patterns": [
                    "survival rates for breast cancer?",
                    "How likely am I to survive breast cancer?",
                    "What affects breast cancer survival rates?"
                ],
                "responses": [
                    "Survival rates depend on the stage at diagnosis. Early detection has a 5-year survival rate of over 90%, while advanced stages have lower rates.",
                    "Treatment advancements continue to improve outcomes for breast cancer patients."
                ]
            },
            {
                "tag": "data_preprocessing",
                "patterns": [
                    "How the data prepared for training?",
                    "preprocessing steps used in this project?",
                    "explain the data cleaning process?"
                ],
                "responses": [
                    "The data was cleaned by removing missing or irrelevant values and ensuring consistent formatting.",
                    "Features were scaled, and the dataset was split into training and testing sets to evaluate the model.",
                    "Visualizations using Seaborn helped analyze the data and understand feature importance."
                ]
            },
            {
                "tag": "limitations",
                "patterns": [
                    "the limitations of this project?",
                    "drawbacks to the breast cancer detection system?",
                    "challenges this system face?"
                ],
                "responses": [
                    "The model's accuracy depends on the quality of input data and may not perform well on unseen data with different patterns.",
                    "It is not a replacement for medical diagnosis and should be used as an assistive tool.",
                    "Further validation and testing on larger datasets are needed to make it robust for clinical use."
                ]
            }
        
    
]
